## SQLite3

In [111]:
import sqlite3

## Create / Connect Database

In [112]:
connection = sqlite3.connect("temp.db")

# cursor is needed to iterate through tables and rows
cursor = connection.cursor()

## Create Table

In [113]:
cursor.execute(
    """
    CREATE TABLE IF NOT EXISTS employees (
        id INTEGER PRIMARY KEY,
        name TEXT NOT NULL,
        age INTEGER,
        department TEXT
    )
    """
)

# Need to commit
connection.commit()

## Insert in Table

In [114]:
# Single Insert
cursor.execute(
    "INSERT INTO employees (name, age, department) VALUES ('Krish', 32, 'Data Scientist')"
)

connection.commit()

In [115]:
employees = [("Bob", 25, "Engineering"), ("Charlie", 35, "Finance")]

# Bulk Insert
cursor.executemany(
    "INSERT INTO employees (name, age, department) VALUES (?,?,?)", employees
)
connection.commit()

## Query Table

In [116]:
cursor.execute("SELECT * FROM employees")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Krish', 32, 'Data Scientist')
(2, 'Bob', 25, 'Engineering')
(3, 'Charlie', 35, 'Finance')

## Update Table

In [117]:
cursor.execute("UPDATE employees SET age = 34 WHERE name = 'Krish'")
connection.commit()

In [118]:
cursor.execute("SELECT * FROM employees")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Krish', 34, 'Data Scientist')
(2, 'Bob', 25, 'Engineering')
(3, 'Charlie', 35, 'Finance')

## Delete from Table

In [119]:
cursor.execute("DELETE FROM employees WHERE name = 'Bob'")
connection.commit()

## Delete Table

In [120]:
cursor.execute("DROP TABLE employees")
connection.commit()

## Practical

In [121]:
connection = sqlite3.connect("sales_data.db")
cursor = connection.cursor()
cursor.execute(
    """
    CREATE TABLE IF NOT EXISTS sales (
        id INTEGER PRIMARY KEY,
        date TEXT NOT NULL,
        product TEXT NOT NULL,
        sales INTEGER,
        region TEXT
    )
    """
)

In [122]:
sales_data = [
    ('2023-01-01', 'ProductA', 100, 'North'),
    ('2023-01-02', 'ProductB', 150, 'South'),
    ('2023-01-03', 'ProductC', 200, 'East'),
    ('2023-01-04', 'ProductD', 250, 'West')
]
cursor.executemany(
    'INSERT INTO sales (date, product, sales, region) VALUES (?, ?, ?, ?)',
    sales_data
)
connection.commit()

In [123]:
cursor.execute("SELECT * FROM sales")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, '2023-01-01', 'ProductA', 100, 'North')
(2, '2023-01-02', 'ProductB', 150, 'South')
(3, '2023-01-03', 'ProductC', 200, 'East')
(4, '2023-01-04', 'ProductD', 250, 'West')

In [124]:

cursor.execute("DROP TABLE sales")
connection.commit()